# VSCode extensions (取得: code --list-extensions)
# 復元: xargs -L1 code --install-extension < config/vscode/extensions.txt
adautomendes.yaml2table-preview
alefragnani.project-manager
amazonwebservices.codewhisperer-for-command-line-companion
castwide.solargraph
christian-kohler.path-intellisense
crystal-spider.jsdoc-generator
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.vscode-github-actions
golang.go
gruntfuggly.todo-tree
humao.rest-client
jebbs.plantuml
jrebocho.vscode-random
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
oderwat.indent-rainbow
pkief.material-icon-theme
rangav.vscode-thunder-client
tomoki1207.pdf
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
zxh404.vscode-proto3
